CSI API ETABS v1
cDStItalianNTC2008S.SetOverwrite Method
 Sets the value of a steel design overwrite item
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOverwrite(
	string Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType.Objects
)
Function SetOverwrite (
	Name As String,
	Item As Integer,
	Value As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDStItalianNTC2008S
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetOverwrite(Name,
	Item, Value, ItemType)
int SetOverwrite(
	String^ Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType::Objects
)
abstract SetOverwrite :
        Name : string *
        Item : int *
        Value : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
Item
Type: System.Int32
 This is an integer between 1 and 58, inclusive, indicating the overwrite item considered.
Design Section
Framing Type
Section Class
Column buckling curve (y-y)
Column buckling curve (z-z)
Buckling curve for LTB
System Overstrength
Is Shape Rolled
Consider Deflection
Deflection check type
DL deflection limit, L/Value
SDL + LL deflection limits, L/Value
LL deflection limit, L/Value
Total load deflection limit, L/Value
Total camber limit, L/Value
DL deflection limit, absolute
SDL + LL deflection limit, absolute
LL deflection limit, absolute
Total load deflection limit, absolute
Total camber limit, absolute
Specified camber
Net area to total area ratio
Live load reduction factor
Unbraced length ratio, Ly
Unbraced length ratio, Lz
Unbraced length ratio, LLTB
Effective length factor, K1y
Effective length factor, K1z
Effective length factor, K2y
Effective length factor, K2z
Effective length factor, KLTB
Bending coefficient, C1
Moment coefficient, kyy
Moment coefficient, kzz
Moment coefficient, kzy
Moment coefficient, kyz
Yield stress, Fy
Material Overstrength, GammaOv
Compressive capacity, Nc,Rd
Tensile capacity. Nt,Rd
Bending capacity Y-Y, Mcy,Rd
Bending capacity Z-Z, Mcz,Rd
Buckling resistance moment, Mb,Rd
Shear capacity Z-Z, Vz,Rd
Shear capacity Y-Y, Vy,Rd
Demand/capacity ratio limit
Bending coefficient, C2
Bending coefficient, C3
Warping constant, Iw
Elastic torsional buckling force, Ncr,T
Elastic torsional-flexural buckling force, Ncr,TF
Elastic critical moment for lateral-torsional buckling, Mcr
Warping coefficient, kw
Coordinate of load application, za
Coordinate of shear center, zs
Bending Coefficients Psi, C2, C3 Option
Value
Type: System.Double
 The numeric value of the considered overwrite item.
 Design Section
 Framing Type
0 = Program Default
1 = DCH-MRF
2 = DCL-MRF
3 = DCH-CBF
4 = DCL-CBF
5 = DCH-EBF
6 = DCL-EBF
7 = InvPendulum
8 = Non Dissipative
 Section Class
0 = Program Default
1 = Class 1
2 = Class 2
3 = Class 3
4 = Class 4
 Column buckling curve (y-y)
0 = Program Default
1 = a0
2 = a
3 = b
4 = c
5 = d
 Column buckling curve (z-z)
0 = Program Default
1 = a0
2 = a
3 = b
4 = c
5 = d
 Buckling curve for LTB
0 = Program Default
1 = a0
2 = a
3 = b
4 = c
5 = d
 System Overstrength
 Value >= 0; 0 means use a program determined value.
 Is Shape Rolled
0 = Program Default
1 = No
2 = Yes
 Consider Deflection
0 = Program Default
1 = No
2 = Yes
 Deflection check type
0 = Program Default
1 = Ratio
2 = Absolute
3 = Both
 DL deflection limit, L/Value
 Value >= 0; 0 means no check for this item.
 SDL + LL deflection limits, L/Value
 Value >= 0; 0 means no check for this item.
 Value >= 0; 0 means no check for this item.
LL deflection limit, L/Value
 Total load deflection limit, L/Value
 Value >= 0; 0 means no check for this item.
 Total camber limit, L/Value
 Value >= 0; 0 means no check for this item.
 DL deflection limit, absolute
 Value >= 0; 0 means no check for this item. [L]
 SDL + LL deflection limit, absolute
 Value >= 0; 0 means no check for this item. [L]
 LL deflection limit, absolute
 Value >= 0; 0 means no check for this item. [L]
 Total load deflection limit, absolute
 Value >= 0; 0 means no check for this item. [L]
 Total camber limit, absolute
 Value >= 0; 0 means no check for this item. [L]
 Specified camber
 Value >= 0; 0 means no check for this item. [L]
 Net area to total area ratio
 Value >= 0; 0 means use program determined value.
 Live load reduction factor
 Value >= 0; 0 means use program determined value.
 Unbraced length ratio, Ly
 Value >= 0; 0 means use program determined value.
 Unbraced length ratio, Lz
 Value >= 0; 0 means use program determined value.
 Unbraced length ratio, LLTB
 Value >= 0; 0 means use program determined value.
 Effective length factor, K1y
 Value >= 0; 0 means use program determined value.
 Effective length factor, K1z
 Value >= 0; 0 means use program determined value.
 Effective length factor, K2y
 Value >= 0; 0 means use program determined value.
 Effective length factor, K2z
 Value >= 0; 0 means use program determined value.
 Effective length factor, KLTB
 Value >= 0; 0 means use program determined value.
 Bending coefficient, C1
 Value >= 0; 0 means use program determined value.
 Moment coefficient, kyy
 Value >= 0; 0 means use program determined value.
 Moment coefficient, kzz
 Value >= 0; 0 means use program determined value.
 Moment coefficient, kzy
 Value >= 0; 0 means use program determined value.
 Moment coefficient, kyz
 Value >= 0; 0 means use program determined value.
 Yield stress, Fy
 Value >= 0; 0 means use program determined value. [F/L^2]
 Material Overstrength, GammaOv
 Value >= 0; 0 means use program determined value.
 Compressive capacity, Nc,Rd
 Value >= 0; 0 means use program determined value. [F]
 Tensile capacity, Nt,Rd
 Value >= 0; 0 means use program determined value. [F]
 Bending capacity Y-Y, Mcy,Rd
 Value >= 0; 0 means use program determined value. [F.L]
 Bending capacity Z-Z, Mcz,Rd
 Value >= 0; 0 means use program determined value. [F.L]
 Buckling resistance moment, Mb.Rd
 Value >= 0; 0 means use program determined value. [F.L]
 Shear capacity Z-Z, Vz,Rd
 Value >= 0; 0 means use program determined value. [F]
 Shear capacity Y-Y, Vy,Rd
 Value >= 0; 0 means use program determined value. [F]
 Demand/capacity ratio limit
 Value >= 0; 0 means use program determined value.
 Bending coefficient, C2
 Value >= 0; 0 means use program determined value.
 Bending coefficient, C3
 Value >= 0; 0 means use program determined value.
 Warping constant, Iw
 Value >= 0; 0 means use program determined value.
 Elastic torsional buckling force, Ncr,T
 Value >= 0; 0 means use program determined value.
 Elastic torsional-flexural buckling force, Ncr,TF
 Value >= 0; 0 means use program determined value.
 Elastic critical moment for lateral-torsional buckling, Mcr
 Value >= 0; 0 means use program determined value.
 Warping coefficient, kw
 Value >= 0; 0 means use program determined value.
 Coordinate of load application, za
 Coordinate of shear center, zs
 Bending Coefficients Psi, C2, C3 Option
1 = Method 1 - EC3
2 = Method 2 - General
3 = Method 3 - User Defined
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the item is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignSteel.SetCode("Italian NTC 2008")
'set overwrite item
   ret = SapModel.DesignSteel.Italian_NTC_2008.SetOverwrite("8", 2, 1)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDStItalianNTC2008S Interface
ETABSv1 Namespace